app/views/articles/index.html.erb

      <%= link_to article.title, article_path(article) %>
      <h6>Comments (<%= article.comments.size %>)</h6>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]