app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.save
---
INSERT INTO "articles" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "First article created in browser"], ["created_at", "2016-04-29 21:37:33.735741"], ["updated_at", "2016-04-29 21:37:33.735741"]]

  def update
    @article = Article.find(params[:id])
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 13]]
UPDATE "articles" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_updated_at", "2016-05-01 17:27:00.791533"], ["image_file_name", "beast.png"], ["updated_at", "2016-05-01 17:27:01.569559"], ["id", 19]]